Revit 2027 API
SpecTypeId.PipingTemperature Property
 Temperature, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingTemperature { get; }
Public Shared ReadOnly Property PipingTemperature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingTemperature {
	ForgeTypeId^ get ();
}
static member PipingTemperature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace